/*  1. Создать проект.
    1.1. С помощью командной строки подключить версионный контроль.
    1.2. С помощью IDEA подготовить все файлы к коммиту.
    1.3. Сделайте первый коммит в IDEA.
    2. Загрузите с помощью терминала внутри IDEA проект на GitHub.
    2.1. Сохраните какие-либо изменения в проекте и сделайте второй коммит через средства IDEA.
    2.2. Отправьте изменения на GitHub (push).
    3. Создайте дополнительную ветвь (branch) и сделайте третий коммит.
    3.1. Измените что-либо в коде в каждой из ветвей.

*/
public class Main {
    public static void main(String[] args) {
        System.out.println("Подключите контроль версий!");
        System.out.println("Теперь проект хранится в облаке!");
        System.out.println("Теперь у нас есть 2 ветви");
        System.out.println("В дополнительной ветви происходят изменения");
    }
}
