/*  1. Создать проект.
    1.1. С помощью командной строки подключить версионный контроль.
    1.2. С помощью IDEA подготовить все файлы к коммиту.
    1.3.
    Загрузить проект на удаленный репозиторий.
        Создать две дополнительные ветки помимо основной.
        Написать в трёх ветках различное решение для вашего проекта.
        Решить конфликт с помощью инструментов IDEA.
*/
public class Main {
    public static void main(String[] args) {
        System.out.println("Подключите контроль версий!");
    }
}
